fio_test/log/128b_seq_read_1job_QD1.log
libpmem: (g=0): rw=read, bs=(R) 128B-128B, (W) 128B-128B, (T) 128B-128B, ioengine=libpmem, iodepth=1
fio-3.20
Starting 1 thread
libpmem: Laying out IO file (1 file / 4096MiB)

libpmem: (groupid=0, jobs=1): err= 0: pid=302889: Wed Mar 10 14:09:14 2021
  read: IOPS=4151k, BW=507MiB/s (531MB/s)(9.90GiB/20000msec)
    clat (nsec): min=29, max=77166, avg=43.02, stdev=75.90
     lat (nsec): min=49, max=77188, avg=65.61, stdev=79.14
    clat percentiles (nsec):
     |  1.00th=[   33],  5.00th=[   34], 10.00th=[   35], 20.00th=[   36],
     | 30.00th=[   43], 40.00th=[   44], 50.00th=[   45], 60.00th=[   45],
     | 70.00th=[   45], 80.00th=[   46], 90.00th=[   46], 95.00th=[   47],
     | 99.00th=[   47], 99.50th=[   48], 99.90th=[   66], 99.95th=[   87],
     | 99.99th=[  580]
   bw (  KiB/s): min=509602, max=526146, per=100.00%, avg=519753.49, stdev=3816.67, samples=39
   iops        : min=4076818, max=4209168, avg=4158031.49, stdev=30533.45, samples=39
  lat (nsec)   : 50=99.81%, 100=0.14%, 250=0.03%, 500=0.01%, 750=0.01%
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%
  cpu          : usr=99.63%, sys=0.12%, ctx=61, majf=0, minf=2060
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=83024389,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=507MiB/s (531MB/s), 507MiB/s-507MiB/s (531MB/s-531MB/s), io=9.90GiB (10.6GB), run=20000-20000msec

Disk stats (read/write):
  pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%